### Introduction

## Relational databases
Relational databases store data in tables with fields (columns) and records (rows), and we can query data and make calculations based on these records.

## SQL magic
Project Jupyter facilitates magic commands that are designed to solve some of the common problems in standard data analysis - these commands are prefixed by the `%` character for `line magic` and a double `%%` prefix for `cell magic`, which operate on multiple lines of input.

The IPython SQL magic extension allows us to write SQL queries into code cells, as well as write these results directly into Pandas DataFrames, which provide fast, flexible, and expressive data structures designed to make working with `relational` or `labeled` data both easy and intuituve, and is arguably the most powerful and flexible open source data analysis / manipulation tool available.

### What is the SQL?
SQL, or Structured Query Language, is a language designed to allow both technical and non-technical users query, manipulate, and transform, and transform data from a relational database. And due to its simplicity, SQL databases provide safe and scalable storage for millions of websites and mobile applications.

Did you know?  
There are many popular SQL databases including SQLite, MySQL, Postgres, Oracle and Microsoft SQL Server. All of them support the common SQL language standard, which is what this site will be teaching, but each implementation can differ in the additional features and storage types it supports.

In [ ]:
# !pip install ipython-sql
# conda install -c conda-forge ipython-sql

In [ ]:
import sqlite3
import sqlalchemy

In [3]:
# To load the SQL module - ipython-sql extension - into the notebook
%load_ext sql

In [4]:
%sql sqlite://

'Connected: @None'

## Lesson 1: SELECT queries 101

- create a SQLite database
- create a data table
- insert data into the table
- query data from the table

`SELECT` statement, which are often colloquially refered to as *quaries*.

Example of table SQL:
```Python
%%sql
CREATE TABLE sales
(
    key       varchar(6),
    ts        timestamp,
    product   integer,
    completed boolean,
    price     float
);
INSERT INTO sales
VALUES ('sale_1', '2019-11-08 00:00', 0, TRUE, 1.1),
       ('sale_2', '2019-11-08 01:00', 0, FALSE, 1.2),
       ('sale_3', '2019-11-08 01:00', 0, TRUE, 1.3),
       ('sale_4', '2019-11-08 01:00', 1, FALSE, 1.4),
       ('sale_5', '2019-11-08 02:00', 1, TRUE, 1.5),
       ('sale_6', '2019-11-08 02:00', 1, TRUE, 1.5);
```

In [5]:
%%sql sqlite://
CREATE TABLE writer
(
    FirstName VARCHAR(50) NOT NULL,
    LastName VARCHAR(50) NOT NULL,
    USERID int NOT NULL UNIQUE,
    PRIMARY KEY (USERID)
);
INSERT INTO writer 
VALUES 
('William', 'Shakespeare', 1616),
('Lin', 'Han', 1996),
('Peter', 'Brecht', 1978);

Done.
3 rows affected.

[]

In [6]:
# %%sql sqlite://
# INSERT INTO writer VALUES ('William', 'Shakespeare', 1616);
# INSERT INTO writer VALUES ('Lin', 'Han', 1996);
# INSERT INTO writer VALUES('Peter', 'Brecht', 1978);

In [7]:
sqlres = %sql SELECT * from writer

 * sqlite://
Done.

In [8]:
sqlres

[('William', 'Shakespeare', 1616),
 ('Lin', 'Han', 1996),
 ('Peter', 'Brecht', 1978)]